Revit 2024 API
DockablePane.PaneExists Method
 Returns true if %id% refers to a dockable pane window that currently exists in the Revit user interface, whether it's hidden or shown.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static bool PaneExists(
	DockablePaneId id
)
Visual Basic
Public Shared Function PaneExists ( _
	id As DockablePaneId _
) As Boolean
Visual C++
public:
static bool PaneExists(
	DockablePaneId^ id
)
Parameters
id
Type: Autodesk.Revit.UI.DockablePaneId
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DockablePane Class
Autodesk.Revit.UI Namespace